driver-tests/jdbcbc/SQLServer/jdbcbc47_SQL_JBI/test/jdbcpoll-onerec-markrow/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <DRIVERTEST_EMP xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
      <ns0:REC_POLL_FLAG xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">1</ns0:REC_POLL_FLAG>
      <ns0:EMPNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">100</ns0:EMPNO>
      <ns0:DEPTNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">10</ns0:DEPTNO>
      <ns0:EMPNAME xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">ename1</ns0:EMPNAME>
    </DRIVERTEST_EMP>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
