driver-tests/sqlse/db2/SqlSE1203_DB2/UpdateAllColumnsJbi/test/SqlSE1203_DB2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://j2ee.netbeans.org/wsdl/SoapWSDL">
  <soapenv:Body>
    <soap:SoapWSDLOperation>
      <part1>1</part1>
    </soap:SoapWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>