driver-tests/jdbcbc/SQLServer/jdbcbc54_SQL_JBI/test/jdbcfind-multiple/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema" xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <DRIVERTEST_EMP xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
    <ns0:EMPNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">100</ns0:EMPNO>
    <ns0:DEPTNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">20</ns0:DEPTNO>
    <ns0:EMPNAME xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">ename1</ns0:EMPNAME>
    <ns0:EMPNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">103</ns0:EMPNO>
    <ns0:DEPTNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">20</ns0:DEPTNO>
    <ns0:EMPNAME xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">ename4</ns0:EMPNAME>
    <ns0:EMPNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">104</ns0:EMPNO>
    <ns0:DEPTNO xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">20</ns0:DEPTNO>
    <ns0:EMPNAME xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">ename5</ns0:EMPNAME>
  </DRIVERTEST_EMP>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
