driver-tests/jdbcbc/SQLServer/jdbcbc58_SQL_JBI/test/jdbcInsert/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tab="http://j2ee.netbeans.org/xsd/tableSchema">
  <soapenv:Body>
    <tab:DRIVERTEST_EMP>
      <tab:REC_POLL_FLAG>1</tab:REC_POLL_FLAG>
      <tab:EMPNO>200</tab:EMPNO>
      <tab:DEPTNO>20</tab:DEPTNO>
      <tab:EMPNAME>ename20</tab:EMPNAME>
    </tab:DRIVERTEST_EMP>
  </soapenv:Body>
</soapenv:Envelope>